app/views/customizepages/customhtml.html.erb

          </div> <!-- /.navbar-header -->
          <% if current_user && current_user.customizepage.present? %>
---
SELECT `customizepages`.* FROM `customizepages` WHERE `customizepages`.`user_id` = 2 LIMIT 1