app/views/customizepages/index.html.erb

SELECT `customizepages`.* FROM `customizepages` WHERE `customizepages`.`user_id` = 2 LIMIT 1
---
                    <div class="fileinput-new thumbnail" style="width: 100px; height: 70px;">
                        <%= image_tag(@customizepage.logo_url) if current_user.try(:customizepage).try(:logo).present?%>