app/views/customizepages/theme2.html.erb

SELECT `customizepages`.* FROM `customizepages` WHERE `customizepages`.`user_id` = 2 LIMIT 1
---
<%#= favicon_link_tag 'favicon.ico' %>
<% if @user.try(:customizepage).try(:favicon).present? %>

SELECT `statuses`.* FROM `statuses` WHERE `statuses`.`id` = 2 LIMIT 1
---
<% @components_all = @user.try(:components) %>
<% @firstStatus = Status.where("user_id=?",@user.try(:id) ).first %>

SELECT `components`.* FROM `components` WHERE `components`.`user_id` = 2
---
      <div class="details">
      <span><strong>Component Name : </strong><%= @user.try(:components).find(incident.try(:component_id)).try(:name) %></span><br/>