app/views/components/index.html.erb

SELECT `statuses`.* FROM `statuses` WHERE `statuses`.`id` = 1 LIMIT 1
---
					<u>Component Status:</u> &nbsp;&nbsp;
					<%= Status.find(component.status_id).name if component.status_id.present? %>