app/views/incidents/index.html.erb


          <% if Status.find(Component.find_by_id(incident.try(:component_id)).try(:status_id)).try(:name) == current_user.try(:statuses).try(:first).try(:name)%>
---
SELECT `components`.* FROM `components` WHERE `components`.`user_id` = 2