app/views/metrics/index.html.erb


    <% totaldatasources = current_user.datasources.all %>
---
SELECT `datasources`.* FROM `datasources` WHERE `datasources`.`user_id` = 2 LIMIT 1


        <% current_user.datasources.find_by_source_name(totaldatasource.source_name).metrics.all.each do |metrict| %>
---
SELECT `datasources`.* FROM `datasources` WHERE `datasources`.`user_id` = 2 AND `datasources`.`source_name` = 'pingdom' LIMIT 1