app/controllers/components_controller.rb

INSERT INTO `components` (`created_at`, `description`, `name`, `status`, `updated_at`, `user_id`) VALUES ('2014-09-21 14:26:12', 'hello world', 'First Component', 'Operational', '2014-09-21 14:26:12', 2)
---
  def create
    #return render json: params.inspect
    # puts '=='*80
    # puts params[:status_id]
    if current_user.components.find_by_name(params['component']['name'])
        redirect_to components_path, :alert => "Component is already present!"
    else
    	@component = Component.new(params[:component])
      @component.user_id = current_user.id
      ######## Creating a random string
      o = [('a'..'z'), ('A'..'Z')].map { |i| i.to_a }.flatten
      string = (0...50).map { o[rand(o.length)] }.join

    	if @component.save

SELECT `components`.* FROM `components` WHERE `components`.`id` = 1 LIMIT 1
---
  def show
    @component = Component.find(params[:id])

SELECT `components`.* FROM `components` WHERE `components`.`id` = 3 LIMIT 1
UPDATE `components` SET `description` = 'investigating', `name` = 'Third', `status` = 'Investigating', `updated_at` = '2014-09-21 16:53:39' WHERE `components`.`id` = 3
---
  def update_component
  	@component = Component.find(params[:id])
    @component.description = params[:description]
    @component.name = params[:name]
    @component.status_id = params[:statusId]
    @component.save!

SELECT `components`.* FROM `components` WHERE `components`.`id` = 1 LIMIT 1
DELETE FROM `components` WHERE `components`.`id` = 1
---
  def destroy
    @component = Component.find(params[:id])
    incisOfSelectedComponent = Incident.where("component_id = ?", params[:id])
    incisOfSelectedComponent.destroy_all