app/controllers/customizepages_controller.rb

UPDATE `customizepages` SET `customcss` = '<style>p{color: red}</style>', `customheader` = '', `customfooter` = '', `updated_at` = '2014-09-23 13:50:21' WHERE `customizepages`.`id` = 1
---
def css_html_update
  @customizepage = current_user.customizepage

    if @customizepage.update_attributes(params[:customizepage])

SELECT `customizepages`.* FROM `customizepages` WHERE `customizepages`.`user_id` = 2 LIMIT 1
SELECT `incidents`.* FROM `incidents` WHERE `incidents`.`user_id` = 2 AND (status !='Resolved') ORDER BY created_at DESC
SELECT `statuses`.* FROM `statuses` WHERE `statuses`.`id` = 2 LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
---
def theme2
  require 'date'

  if params[:userurl].present?

    if User.find_by_customurl(params[:userurl])
       @user = User.find_by_customurl(params[:userurl])
    end
    if params[:subscriber].present?
      @subscriber = @user.subscriber.build(params[:subscriber])
    end
    if params[:clients].present?
      @sms = @user.sms.build(params[:clients])
    end
  else

    @user = current_user
    if params[:subscriber].present?
      @subscriber = @user.subscriber.build(params[:subscriber])
    end
    if params[:clients].present?
      @sms = @user.sms.build(params[:clients])
    end
  end

  if @user.present?
    @customizepage = @user.customizepage
    # if @user.history > 0
    @incidents = @user.incidents.where("status =? AND created_at >=?", @user.try(:states).try(:last).try(:id), Date.today - @user.history).find(:all, :order => "created_at DESC")

SELECT `components`.* FROM `components` WHERE `components`.`user_id` = 2
---
    #   st.name
    @unresolved_incidents = @user.incidents.where("status !=?", @user.try(:states).try(:last).try(:id) ).find(:all, :order => "created_at DESC")
    @components = @user.components
    @firstcomponent = @user.components.first

SELECT `datasources`.* FROM `datasources` WHERE `datasources`.`user_id` = 2 AND `datasources`.`source_name` = 'pingdom' LIMIT 1
---

    @validMaintenance = @maintenance.where("end_at >=?",DateTime.now)

    @pingcredentials  = @user.datasources.where(source_name: "pingdom").first