app/controllers/home_controller.rb

SELECT `customizepages`.* FROM `customizepages` WHERE `customizepages`.`user_id` = 2 LIMIT 1
INSERT INTO `customizepages` (`background_color`, `coverimage`, `created_at`, `customcss`, `customfooter`, `customheader`, `favicon`, `font_color`, `greens`, `link_color`, `reds`, `theme`, `updated_at`, `user_id`, `yellows`) VALUES ('#ffffff', NULL, '2014-09-21 15:43:20', NULL, NULL, NULL, NULL, '#000000', '#008000', '#0000ff', '#ff0000', 'theme2', '2014-09-21 15:43:20', 2, '#ffff00')
UPDATE `users` SET `random_key` = 'SjSVFIitGNNxIXJAZnOqvYwPxgnVjelahGVmdDGEYjMCSzyDXG', `updated_at` = '2014-09-23 12:01:56' WHERE `users`.`id` = 2
SELECT `statuses`.* FROM `statuses` WHERE `statuses`.`user_id` = 2
INSERT INTO `statuses` (`created_at`, `name`, `updated_at`, `user_id`) VALUES ('2014-09-23 06:50:54', 'operational', '2014-09-23 06:50:54', 2)
---
  def index
    if current_user && current_user.try(:customizepage).present?
    elsif current_user
      @customizepagecreate = current_user.build_customizepage
      @customizepagecreate.theme = "theme2"
      @customizepagecreate.background_color = "#ffffff"
      @customizepagecreate.font_color = "#000000"
      @customizepagecreate.link_color = "#0000ff"
      @customizepagecreate.yellows = "#ffff00"
      @customizepagecreate.reds = "#ff0000"
      @customizepagecreate.greens = "#008000"
      @customizepagecreate.logoname = current_user.username
      @customizepagecreate.abouttexttitle = "Description"
      @customizepagecreate.systemcomponentstitle = "System Components"
      @customizepagecreate.abouttext = "This is dummy about text."
      @customizepagecreate.save!
    end
    if current_user && current_user.statuses.blank?
      statuses = ["Fully Operational","Scheduled Maintenance","Minor Interruption","Major Interruption"]
      statuses.each do |status|
        @status = current_user.statuses.build
        @status.name = status
        @status.default_value = status
        @status.save!

SELECT `components`.* FROM `components` WHERE `components`.`user_id` = 2
SELECT `incidents`.* FROM `incidents` WHERE `incidents`.`user_id` = 2 AND (status !='Resolved')
SELECT `statuses`.* FROM `statuses` WHERE `statuses`.`user_id` = 2
---
  def dashboard
    # @mywebhook = HTTParty.get("http://localhost:3000/notifications/multiply", :params => {:x => 10, :y => 10})
    # @components = Component.where(user_id:,current_user.id)
    @components = current_user.components
  	@incidents = current_user.incidents.where("status !=?",'Resolved')

SELECT `components`.* FROM `components` WHERE `components`.`id` = 1 LIMIT 1
UPDATE `components` SET `status` = 'Degraded Performance', `updated_at` = '2014-09-21 15:22:11' WHERE `components`.`id` = 1
---
  def status_change
    @component = Component.find(params[:id])
    @component.status_id = params[:statusid]
    @component.save!