app/controllers/incidents_controller.rb

  def new
    @incident = Incident.new(params[:incident])
    @components = Component.where("user_id=?",current_user.id)
    @states = current_user.try(:states)
    @statuses = current_user.try(:statuses)
    @statfirst = current_user.components.first
---
SELECT `components`.* FROM `components` WHERE (user_id=2)
SELECT `components`.* FROM `components`

  def create
     # return render json: params.inspect
    if current_user.components.find_by_id(params[:incident][:component_id]).incidents.find_by_name(params[:incident][:name])
        redirect_to new_incident_path, :alert => "Incident already belongs to selected component!"
    else
      component = Component.find(params[:incident][:component_id])
      component.status_id = params[:incident][:statId]

    	@incident = component.incidents.build(params[:incident])
      @incident.user_id = current_user.id
    	if @incident.save
        component.save!
        limitexceeded = false
        somesent = false

        if params[:tweet]
          twitter_client = get_twitter_client
          msg = current_user.try(:tweetincidentformat)
          msg = msg.gsub("$$incident_name$$", @incident.try(:name))
          msg = msg.gsub("$$incident_state$$", State.find_by_id(@incident.try(:status).to_i).try(:name))
---
SELECT `components`.* FROM `components` WHERE `components`.`id` = 1 LIMIT 1
INSERT INTO `incidents` (`component_id`, `created_at`, `message`, `name`, `status`, `updated_at`, `user_id`) VALUES (1, '2014-09-21 15:53:58', 'hello world', 'first incident', 'Investigating', '2014-09-21 15:53:58', 2)
SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1

  def show
    @incident = Incident.find(params[:id])
---
SELECT `incidents`.* FROM `incidents` WHERE `incidents`.`id` = 2 LIMIT 1

  def edit
    @states = current_user.try(:states)
    @incident = Incident.find(params[:id])
    @statuses = current_user.statuses
    @components = Component.all
---
SELECT `incidents`.* FROM `incidents` WHERE `incidents`.`id` = 1 LIMIT 1
SELECT `components`.* FROM `components`

  def update
    # return render json: params.inspect
    @incident = Incident.find(params[:id])
    respond_to do |format|
      if @incident.update_attributes(params[:incident])
---
SELECT `incidents`.* FROM `incidents` WHERE `incidents`.`id` = 2 LIMIT 1
UPDATE `incidents` SET `message` = 'hello devsinc 10', `updated_at` = '2014-09-21 15:57:53' WHERE `incidents`.`id` = 2

  def destroy
    @incident = Incident.find(params[:id])
    @incident.destroy
---
SELECT `incidents`.* FROM `incidents` WHERE `incidents`.`id` = 2 LIMIT 1
DELETE FROM `incidents` WHERE `incidents`.`id` = 2