app/controllers/metrics_controller.rb

SELECT `datasources`.* FROM `datasources` WHERE `datasources`.`user_id` = 2 AND `datasources`.`source_name` = 'pingdom' LIMIT 1
INSERT INTO `metrics` (`created_at`, `datasource_id`, `displayit`, `hostname`, `name`, `status`, `updated_at`, `userdef_name`) VALUES ('2014-09-23 06:52:46', 1, NULL, 'gotlinks.com', 'Gotlinks', 'down', '2014-09-23 06:52:46', NULL)
---
def index
  	@datasource = current_user.datasources.find_by_source_name("pingdom") || current_user.datasources.build
  	@datasourcesut = current_user.datasources.find_by_source_name("siteuptime") || current_user.datasources.build

  	@userdatasources = current_user.datasources.all

  	# @pingcredentials = Datasource.find_by_user_id_and_source_name( current_user.id , "pingdom")
    @pingcredentials  = current_user.datasources.where(source_name: "pingdom").first

  	# @siteuptcredentials = Datasource.find_by_user_id_and_source_name( current_user.id , "siteuptime")
    @siteuptcredentials = current_user.datasources.where(source_name: "siteuptime").first

  	@updated_metric = Metric.new

    ######### Synchronizing pingdom checks with our database
  	@newmetric = ""
  	metricscount = 0
  	oldmetrics = []
  	metricsfromsite = []
  	if @pingcredentials
  		response = HTTParty.get("https://api.pingdom.com/api/2.0/checks", :basic_auth => {:username => @pingcredentials.ds_email, :password => @pingcredentials.ds_pass}, :headers => { "App-Key" => @pingcredentials.ds_appkey })
  		response["checks"].each do |check|
  			metricsfromsite << check["hostname"]

INSERT INTO `datasources` (`created_at`, `ds_appkey`, `ds_email`, `ds_pass`, `source_name`, `updated_at`, `user_id`) VALUES ('2014-09-23 06:52:45', '8rlvugf578p9f99i11oabur7p8la7w7n', 'dm@dmar.net', 'test123', 'pingdom', '2014-09-23 06:52:45', 2)
---
  def pingdom_auth
  	@datasource = current_user.datasources.build(params[:datasource])
  	# @datasource.user_id = current_user.id
    @datasource.source_name = "pingdom"
    usremail = @datasource.ds_email
    usrpass = @datasource.ds_pass
    usrappkey = @datasource.ds_appkey
    response = HTTParty.get("https://api.pingdom.com/api/2.0/checks", :basic_auth => {:username => usremail, :password => usrpass}, :headers => { "App-Key" => usrappkey })
    if response["error"]
    	flash[:alert] = response['error']['errormessage'].to_s
    	redirect_to metrics_path
    elsif @datasource.save

SELECT `datasources`.* FROM `datasources` WHERE `datasources`.`user_id` = 2 AND `datasources`.`id` = 1 LIMIT 1
SELECT `metrics`.* FROM `metrics` WHERE `metrics`.`datasource_id` = 1 AND `metrics`.`id` = 2 LIMIT 1
UPDATE `metrics` SET `userdef_name` = 'EduLeaf', `displayit` = 1, `updated_at` = '2014-09-23 06:53:09' WHERE `metrics`.`id` = 2
---
  def add_metric
  	#### DUMMY Metric
  	# return render json: params.inspect
  	@metrictoupdate = current_user.datasources.find_by_id(params[:metric][:datasourcearr]).metrics.find_by_id(params[:metric][:name])
  	@metrictoupdate.userdef_name = params[:metric][:userdef_name]
  	@metrictoupdate.displayit = true;
  	if @metrictoupdate.save