app/controllers/resources_controller.rb

SELECT `datasources`.* FROM `datasources` WHERE `datasources`.`user_id` = 2 AND `datasources`.`source_name` = 'pingdom' LIMIT 1
---
  def index
  	if current_user && current_user.datasources.find_by_source_name("pingdom")