app/controllers/users_controller.rb

  def status
    status = current_user.statuses.find(params[:status][:id])
    status.name = params[:status][:name]
    if status.save!
---
SELECT `statuses`.* FROM `statuses` WHERE `statuses`.`user_id` = 2 AND `statuses`.`id` = 1 LIMIT 1
UPDATE `statuses` SET `name` = 'operating normally', `updated_at` = '2014-09-23 12:19:17' WHERE `statuses`.`id` = 1